Revit 2027 API
BuiltInFailures.DesignOptionFailures.BadReferenceToSecondaryWarn Property
 No element in a secondary Option can be referenced by an element outside that Option.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId BadReferenceToSecondaryWarn { get; }
Public Shared ReadOnly Property BadReferenceToSecondaryWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ BadReferenceToSecondaryWarn {
	FailureDefinitionId^ get ();
}
static member BadReferenceToSecondaryWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DesignOptionFailures Class
Autodesk.Revit.DB Namespace